app/controllers/api/sips_controller.rb

  def index
    @sips = Sip.all.includes(:author)
---
SELECT "sips".* FROM "sips"